# Introduction
## General
"Data analysis is a process of inspecting, cleaning, transforming, and modeling data with the goal of discovering useful information, informing conclusions, and supporting decision-making." ([Wikipedia](https://en.wikipedia.org/wiki/Data_analysis)).

In this notebook we are going to clean and modify data from different workbooks and merge the data to do some visualizations on a dashboard

In [1]:
# Data handling
import pandas as pd
import numpy as np


# Vizualisation (Matplotlib, Plotly, Seaborn, etc. )

import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
%matplotlib inline
from pandas.plotting import lag_plot

# Loading Datasets

In [2]:
df_Jan = pd.read_excel("Sales_January_2019.xlsx", parse_dates = True)
df_Feb = pd.read_excel("Sales_February_2019.xlsx", parse_dates = True)
df_Mar = pd.read_excel("Sales_March_2019.xlsx", parse_dates = True)
df_Apr = pd.read_excel("Sales_April_2019.xlsx", parse_dates = True)
df_May = pd.read_excel("Sales_May_2019.xlsx", parse_dates = True)
df_Jun = pd.read_excel("Sales_June_2019.xlsx", parse_dates = True)
df_Jul = pd.read_excel("Sales_July_2019.xlsx", parse_dates = True)
df_Aug = pd.read_excel("Sales_August_2019.xlsx", parse_dates = True)
df_Sep = pd.read_excel("Sales_September_2019.xlsx", parse_dates = True)
df_Oct = pd.read_excel("Sales_October_2019.xlsx", parse_dates = True)
df_Nov = pd.read_excel("Sales_November_2019.xlsx", parse_dates = True)
df_Dec = pd.read_excel("Sales_December_2019.xlsx", parse_dates = True)

In [3]:
df_Jan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          9697 non-null   object
 1   Product           9697 non-null   object
 2   Quantity Ordered  9697 non-null   object
 3   Price Each        9697 non-null   object
 4   Order Date        9697 non-null   object
 5   Purchase Address  9697 non-null   object
dtypes: object(6)
memory usage: 455.9+ KB

In [4]:
df_Feb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12036 entries, 0 to 12035
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          12004 non-null  object
 1   Product           12004 non-null  object
 2   Quantity Ordered  12004 non-null  object
 3   Price Each        12004 non-null  object
 4   Order Date        12004 non-null  object
 5   Purchase Address  12004 non-null  object
dtypes: object(6)
memory usage: 564.3+ KB

In [5]:
df_Mar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15226 entries, 0 to 15225
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          15189 non-null  object
 1   Product           15189 non-null  object
 2   Quantity Ordered  15189 non-null  object
 3   Price Each        15189 non-null  object
 4   Order Date        15189 non-null  object
 5   Purchase Address  15189 non-null  object
dtypes: object(6)
memory usage: 713.8+ KB

In [6]:
df_Apr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18383 entries, 0 to 18382
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          18324 non-null  object
 1   Product           18324 non-null  object
 2   Quantity Ordered  18324 non-null  object
 3   Price Each        18324 non-null  object
 4   Order Date        18324 non-null  object
 5   Purchase Address  18324 non-null  object
dtypes: object(6)
memory usage: 861.8+ KB

In [7]:
df_May.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16635 entries, 0 to 16634
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          16587 non-null  object
 1   Product           16587 non-null  object
 2   Quantity Ordered  16587 non-null  object
 3   Price Each        16587 non-null  object
 4   Order Date        16587 non-null  object
 5   Purchase Address  16587 non-null  object
dtypes: object(6)
memory usage: 779.9+ KB

In [8]:
df_Jun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13622 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          13579 non-null  object
 1   Product           13579 non-null  object
 2   Quantity Ordered  13579 non-null  object
 3   Price Each        13579 non-null  object
 4   Order Date        13579 non-null  object
 5   Purchase Address  13579 non-null  object
dtypes: object(6)
memory usage: 638.7+ KB

In [ ]:
df_Jul.info()

In [10]:
df_Aug.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11957 entries, 0 to 11956
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          11957 non-null  int64
 1   Product           11957 non-null  object
 2   Quantity_Ordered  11957 non-null  int64
 3   Price_Each        11957 non-null  float64
 4   Order_Date        11957 non-null  datetime64[ns]
 5   Purchase_Address  11957 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 560.6+ KB

In [11]:
df_Sep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11628 entries, 0 to 11627
Data columns (total 6 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   248151                               11628 non-null  int64
 1   AA Batteries (4-pack)                11628 non-null  object
 2   4                                    11628 non-null  int64
 3   3.8399999141693115                   11628 non-null  float64
 4   2017-09-19 14:44:00                  11628 non-null  datetime64[ns]
 5   380 North St, Los Angeles, CA 90001  11628 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 545.2+ KB

In [12]:
df_Oct.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20284 entries, 0 to 20283
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          20284 non-null  int64
 1   Product           20284 non-null  object
 2   Quantity_Ordered  20284 non-null  int64
 3   Price_Each        20284 non-null  float64
 4   Order_Date        20284 non-null  datetime64[ns]
 5   Purchase_Address  20284 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 950.9+ KB

In [13]:
df_Nov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17580 entries, 0 to 17579
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          17580 non-null  int64
 1   Product           17580 non-null  object
 2   Quantity_Ordered  17580 non-null  int64
 3   Price_Each        17580 non-null  float64
 4   Order_Date        17580 non-null  datetime64[ns]
 5   Purchase_Address  17580 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 824.2+ KB

In [14]:
df_Dec.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24988 entries, 0 to 24987
Data columns (total 6 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   295665                                  24988 non-null  int64
 1   Macbook Pro Laptop                      24988 non-null  object
 2   1                                       24988 non-null  int64
 3   1700                                    24988 non-null  float64
 4   2030-12-19 00:01:00                     24988 non-null  datetime64[ns]
 5   136 Church St, New York City, NY 10001  24988 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 1.1+ MB

###### Running through each file it is noticed that July, September and December files have no column headers as the others.
###### Also the datatypes of the first half of the year is not equal to the second half

## Data Cleaning

In [15]:
#Adding column headers
df_Dec.columns = ['Order_ID','Product','Quantity_Ordered','Price_Each','Order_Date','Purchase_Address']
df_Jul.columns = ['Order_ID','Product','Quantity_Ordered','Price_Each','Order_Date','Purchase_Address']
df_Sep.columns = ['Order_ID','Product','Quantity_Ordered','Price_Each','Order_Date','Purchase_Address']

In [16]:
df_Dec.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24988 entries, 0 to 24987
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          24988 non-null  int64
 1   Product           24988 non-null  object
 2   Quantity_Ordered  24988 non-null  int64
 3   Price_Each        24988 non-null  float64
 4   Order_Date        24988 non-null  datetime64[ns]
 5   Purchase_Address  24988 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 1.1+ MB

In [17]:
df_Jan['Sales_Month'] = 'January'
df_Feb['Sales_Month'] = 'February'
df_Mar['Sales_Month'] = 'March'
df_Apr['Sales_Month'] = 'April'
df_May['Sales_Month'] = 'May'
df_Jun['Sales_Month'] = 'June'
df_Jul['Sales_Month'] = 'July'
df_Aug['Sales_Month'] = 'August'
df_Sep['Sales_Month'] = 'September'
df_Oct['Sales_Month'] = 'October'
df_Nov['Sales_Month'] = 'November'
df_Dec['Sales_Month'] = 'December'

In [18]:
df_Jan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          9697 non-null   object
 1   Product           9697 non-null   object
 2   Quantity Ordered  9697 non-null   object
 3   Price Each        9697 non-null   object
 4   Order Date        9697 non-null   object
 5   Purchase Address  9697 non-null   object
 6   Sales_Month       9723 non-null   object
dtypes: object(7)
memory usage: 531.9+ KB

In [19]:
#Changing the column names of the first half of the year 
df_Jan.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)
df_Feb.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)
df_Mar.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)
df_Apr.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)
df_May.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)
df_Jun.rename(columns = {'Order ID': 'Order_ID','Quantity Ordered':'Quantity_Ordered','Price Each':'Price_Each','Order Date':'Order_Date','Purchase Address':'Purchase_Address'}, inplace=True)

In [35]:
#Merging the data from first half of the year since the datatypes of all columns are the same
First_half = pd.concat([df_Jan,df_Feb,df_Mar,df_Apr,df_May,df_Jun])

In [36]:
First_half.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address,Sales_Month
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215",January
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035",January
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016",January
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001",January
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301",January

In [37]:
First_half.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 85599 entries, 0 to 13621
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          85380 non-null  object
 1   Product           85380 non-null  object
 2   Quantity_Ordered  85380 non-null  object
 3   Price_Each        85380 non-null  object
 4   Order_Date        85380 non-null  object
 5   Purchase_Address  85380 non-null  object
 6   Sales_Month       85599 non-null  object
dtypes: object(7)
memory usage: 5.2+ MB

In [38]:
First_half[First_half.isna().any(axis=1)]

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address,Sales_Month
75,NaN,NaN,NaN,NaN,NaN,NaN,February
169,NaN,NaN,NaN,NaN,NaN,NaN,February
172,NaN,NaN,NaN,NaN,NaN,NaN,February
1488,NaN,NaN,NaN,NaN,NaN,NaN,February
1517,NaN,NaN,NaN,NaN,NaN,NaN,February
...,...,...,...,...,...,...,...
12567,NaN,NaN,NaN,NaN,NaN,NaN,June
12640,NaN,NaN,NaN,NaN,NaN,NaN,June
12659,NaN,NaN,NaN,NaN,NaN,NaN,June
12732,NaN,NaN,NaN,NaN,NaN,NaN,June
13352,NaN,NaN,NaN,NaN,NaN,NaN,June

In [39]:
First_half = First_half.dropna()

In [40]:
First_half.isnull().values.any()

False

In [41]:
#Merging the second half of the year's data
Second_half = pd.concat([df_Jul,df_Aug,df_Sep,df_Oct,df_Nov,df_Dec])

In [42]:
Second_half.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100727 entries, 0 to 24987
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order_ID          100727 non-null  int64
 1   Product           100727 non-null  object
 2   Quantity_Ordered  100727 non-null  int64
 3   Price_Each        100727 non-null  float64
 4   Order_Date        100727 non-null  datetime64[ns]
 5   Purchase_Address  100727 non-null  object
 6   Sales_Month       100727 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 6.1+ MB

#### The info above shows that there is no null values

In [52]:
Full_Year = pd.concat([Second_half,First_half])

In [53]:
Full_Year.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186107 entries, 0 to 13621
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order_ID          186107 non-null  object
 1   Product           186107 non-null  object
 2   Quantity_Ordered  186107 non-null  object
 3   Price_Each        186107 non-null  object
 4   Order_Date        186107 non-null  object
 5   Purchase_Address  186107 non-null  object
 6   Sales_Month       186107 non-null  object
dtypes: object(7)
memory usage: 11.4+ MB

In [47]:
Full_Year.isnull().values.any()

False

In [48]:
Full_Year.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address,Sales_Month
0,141234,iPhone,1,700,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215",January
1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035",January
2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016",January
3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001",January
4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301",January

In [49]:
Full_Year.tail()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address,Sales_Month
24983,319666,Lightning Charging Cable,1,14.95,2011-12-19 20:58:00,"14 Madison St, San Francisco, CA 94016",December
24984,319667,AA Batteries (4-pack),2,3.84,2001-12-19 12:01:00,"549 Willow St, Los Angeles, CA 90001",December
24985,319668,Vareebadd Phone,1,400.0,2009-12-19 06:43:00,"273 Wilson St, Seattle, WA 98101",December
24986,319669,Wired Headphones,1,11.99,2003-12-19 10:39:00,"778 River St, Dallas, TX 75001",December
24987,319670,Bose SoundSport Headphones,1,99.989998,2021-12-19 21:45:00,"747 Chestnut St, Los Angeles, CA 90001",December

In [55]:
Full_Year.to_excel('Sales_2019.xlsx')